MDS/DEV/apps/SOA-INFRA/WSDL/UpsertOptyLineItemSiebelProvABCSImpl.wsdl

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions name="UpsertOptyLineItemSiebelProvABCSImpl" targetNamespace="http:/IsecG/SalesforceProject/OpportunityFromSFtoSiebel/UpsertOptyLineItemSiebelProvABCSImpl" xmlns:ns2="http://schemas.oracle.com/bpel/extension" xmlns:ns1="urn:enterprise.soap.sforce.com" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:ns4="http://www.siebel.com/xml/OptyEventsToProcessFromBroker" xmlns:ns3="http://SalesforceIntegration/Opty_SFIds" xmlns:client="http:/IsecG/SalesforceProject/OpportunityFromSFtoSiebel/UpsertOptyLineItemSiebelProvABCSImpl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
<plnk:partnerLinkType name="UpsertOptyLineItemSiebelProvABCSImpl">
<plnk:role name="UpsertOptyLineItemSiebelProvABCSImplProvider" portType="client:UpsertOptyLineItemSiebelProvABCSImpl"/>
</plnk:partnerLinkType>
<wsdl:import namespace="urn:enterprise.soap.sforce.com" location="oramds:/apps/WSDL/generateEnterprise.wsdl"/>
<wsdl:import namespace="http://schemas.oracle.com/bpel/extension" location="oramds:/apps/WSDL/RuntimeFault.wsdl"/>
<wsdl:types>
<schema xmlns="http://www.w3.org/2001/XMLSchema">
<import namespace="http:/IsecG/SalesforceProject/OpportunityFromSFtoSiebel/UpsertOptyLineItemSiebelProvABCSImpl" schemaLocation="oramds:/apps/SOA-INFRA/XSD/UpsertOptyLineItemSiebelProvABCSImpl.xsd"/>
</schema>
<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<xsd:import namespace="http://SalesforceIntegration/Opty_SFIds" schemaLocation="oramds:/apps/XSD/Opportunity/OptySF_Id.xsd"/>
</xsd:schema>
<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<xsd:import namespace="http://www.siebel.com/xml/OptyEventsToProcessFromBroker" schemaLocation="oramds:/apps/SOA-INFRA/XSD/OptyEventsFromEAIBrokerToProcess.xsd"/>
</xsd:schema>
</wsdl:types>
<wsdl:message name="UpsertOptyLineItemSiebelProvABCSImplRequestMessage">
<wsdl:part name="payload" element="client:process"/>
<wsdl:part name="Events" element="ns4:EventsToProcess"/>
<wsdl:part name="SFPayload" element="ns1:create"/>
</wsdl:message>
<wsdl:message name="UpsertOptyLineItemSiebelProvABCSImplResponseMessage">
<wsdl:part name="payload" element="client:processResponse"/>
</wsdl:message>
<wsdl:portType name="UpsertOptyLineItemSiebelProvABCSImpl">
<wsdl:operation name="process">
<wsdl:input message="client:UpsertOptyLineItemSiebelProvABCSImplRequestMessage"/>
<wsdl:output message="client:UpsertOptyLineItemSiebelProvABCSImplResponseMessage"/>
</wsdl:operation>
</wsdl:portType>
</wsdl:definitions>
